#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: renovate[bot], Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
data.sakuracloud_archive.ubuntu_archive: Reading...
sakuracloud_switch.k8s_internal_switch: Refreshing state... [id=113602111795]
sakuracloud_ssh_key_gen.gen_key: Refreshing state... [id=113602111788]
sakuracloud_disk.k8s_rook_disk[6]: Refreshing state... [id=113602111790]
sakuracloud_disk.k8s_rook_disk[2]: Refreshing state... [id=113602111796]
sakuracloud_disk.k8s_rook_disk[5]: Refreshing state... [id=113602111805]
sakuracloud_disk.k8s_rook_disk[7]: Refreshing state... [id=113602111791]
sakuracloud_disk.k8s_rook_disk[4]: Refreshing state... [id=113602111799]
sakuracloud_disk.k8s_rook_disk[0]: Refreshing state... [id=113602111792]
sakuracloud_disk.k8s_rook_disk[1]: Refreshing state... [id=113602111789]
sakuracloud_disk.k8s_rook_disk[3]: Refreshing state... [id=113602111794]
sakuracloud_internet.k8s_external_switch: Refreshing state... [id=113602111793]
data.sakuracloud_archive.ubuntu_archive: Read complete after 1s [id=113601947038]
sakuracloud_disk.k8s_worker_node_disk[7]: Refreshing state... [id=113602111810]
sakuracloud_disk.k8s_worker_node_disk[0]: Refreshing state... [id=113602111812]
sakuracloud_disk.k8s_worker_node_disk[1]: Refreshing state... [id=113602111808]
sakuracloud_disk.k8s_worker_node_disk[5]: Refreshing state... [id=113602111809]
sakuracloud_disk.k8s_worker_node_disk[2]: Refreshing state... [id=113602111806]
sakuracloud_disk.k8s_worker_node_disk[3]: Refreshing state... [id=113602111816]
sakuracloud_disk.k8s_worker_node_disk[4]: Refreshing state... [id=113602111807]
sakuracloud_disk.k8s_worker_node_disk[6]: Refreshing state... [id=113602111815]
sakuracloud_disk.k8s_control_plane_disk[0]: Refreshing state... [id=113602111798]
sakuracloud_disk.k8s_control_plane_disk[1]: Refreshing state... [id=113602111804]
sakuracloud_disk.k8s_control_plane_disk[2]: Refreshing state... [id=113602111800]
sakuracloud_vpc_router.k8s_internal_router: Refreshing state... [id=113602111817]
sakuracloud_server.k8s_worker_node[1]: Refreshing state... [id=113602111841]
sakuracloud_server.k8s_worker_node[0]: Refreshing state... [id=113602111851]
sakuracloud_server.k8s_worker_node[6]: Refreshing state... [id=113602111853]
sakuracloud_server.k8s_worker_node[5]: Refreshing state... [id=113602111840]
sakuracloud_server.k8s_worker_node[3]: Refreshing state... [id=113602111843]
sakuracloud_server.k8s_worker_node[2]: Refreshing state... [id=113602111842]
sakuracloud_server.k8s_worker_node[7]: Refreshing state... [id=113602111838]
sakuracloud_server.k8s_worker_node[4]: Refreshing state... [id=113602111839]
sakuracloud_server.k8s_control_plane[0]: Refreshing state... [id=113602111831]
sakuracloud_server.k8s_control_plane[2]: Refreshing state... [id=113602111823]
sakuracloud_server.k8s_control_plane[1]: Refreshing state... [id=113602111830]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sakuracloud_disk.k8s_control_plane_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113602111798" -> (known after apply)
        name                 = "k8s-dev-control-plane-1"
      ~ server_id            = "113602111831" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113602111804" -> (known after apply)
        name                 = "k8s-dev-control-plane-2"
      ~ server_id            = "113602111830" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113602111800" -> (known after apply)
        name                 = "k8s-dev-control-plane-3"
      ~ server_id            = "113602111823" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602111812" -> (known after apply)
        name                 = "k8s-dev-worker-node-1"
      ~ server_id            = "113602111851" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602111808" -> (known after apply)
        name                 = "k8s-dev-worker-node-2"
      ~ server_id            = "113602111841" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602111806" -> (known after apply)
        name                 = "k8s-dev-worker-node-3"
      ~ server_id            = "113602111842" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[3] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602111816" -> (known after apply)
        name                 = "k8s-dev-worker-node-4"
      ~ server_id            = "113602111843" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[4] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602111807" -> (known after apply)
        name                 = "k8s-dev-worker-node-5"
      ~ server_id            = "113602111839" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[5] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602111809" -> (known after apply)
        name                 = "k8s-dev-worker-node-6"
      ~ server_id            = "113602111840" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[6] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602111815" -> (known after apply)
        name                 = "k8s-dev-worker-node-7"
      ~ server_id            = "113602111853" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[7] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602111810" -> (known after apply)
        name                 = "k8s-dev-worker-node-8"
      ~ server_id            = "113602111838" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_server.k8s_control_plane[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113602111798",
        ] -> (known after apply)
        id                = "113602111831"
        name              = "k8s-dev-control-plane-1"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113602111804",
        ] -> (known after apply)
        id                = "113602111830"
        name              = "k8s-dev-control-plane-2"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113602111800",
        ] -> (known after apply)
        id                = "113602111823"
        name              = "k8s-dev-control-plane-3"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602111812",
          - "113602111792",
        ] -> (known after apply)
        id                = "113602111851"
        name              = "k8s-dev-worker-node-1"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602111808",
          - "113602111789",
        ] -> (known after apply)
        id                = "113602111841"
        name              = "k8s-dev-worker-node-2"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602111806",
          - "113602111796",
        ] -> (known after apply)
        id                = "113602111842"
        name              = "k8s-dev-worker-node-3"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[3] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602111816",
          - "113602111794",
        ] -> (known after apply)
        id                = "113602111843"
        name              = "k8s-dev-worker-node-4"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[4] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602111807",
          - "113602111799",
        ] -> (known after apply)
        id                = "113602111839"
        name              = "k8s-dev-worker-node-5"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[5] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602111809",
          - "113602111805",
        ] -> (known after apply)
        id                = "113602111840"
        name              = "k8s-dev-worker-node-6"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[6] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602111815",
          - "113602111790",
        ] -> (known after apply)
        id                = "113602111853"
        name              = "k8s-dev-worker-node-7"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[7] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602111810",
          - "113602111791",
        ] -> (known after apply)
        id                = "113602111838"
        name              = "k8s-dev-worker-node-8"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 11 to add, 11 to change, 11 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>